evidence/ops-2201-before-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2201.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * shift_change_search: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 8 complete and 0 interrupted iterations
shift_change_search   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 25 complete and 0 interrupted iterations
shift_change_search   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 42 complete and 0 interrupted iterations
shift_change_search   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 64 complete and 0 interrupted iterations
shift_change_search   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 86 complete and 0 interrupted iterations
shift_change_search   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 103 complete and 0 interrupted iterations
shift_change_search   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 120 complete and 0 interrupted iterations
shift_change_search   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 138 complete and 0 interrupted iterations
shift_change_search   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 162 complete and 0 interrupted iterations
shift_change_search   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 178 complete and 0 interrupted iterations
shift_change_search   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 194 complete and 0 interrupted iterations
shift_change_search   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 213 complete and 0 interrupted iterations
shift_change_search   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 233 complete and 0 interrupted iterations
shift_change_search   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 254 complete and 0 interrupted iterations
shift_change_search   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 276 complete and 0 interrupted iterations
shift_change_search   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 294 complete and 0 interrupted iterations
shift_change_search   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 315 complete and 0 interrupted iterations
shift_change_search   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 332 complete and 0 interrupted iterations
shift_change_search   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 354 complete and 0 interrupted iterations
shift_change_search   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 374 complete and 0 interrupted iterations
shift_change_search   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 395 complete and 0 interrupted iterations
shift_change_search   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 416 complete and 0 interrupted iterations
shift_change_search   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 438 complete and 0 interrupted iterations
shift_change_search   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 458 complete and 0 interrupted iterations
shift_change_search   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 475 complete and 0 interrupted iterations
shift_change_search   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 496 complete and 0 interrupted iterations
shift_change_search   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 515 complete and 0 interrupted iterations
shift_change_search   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 536 complete and 0 interrupted iterations
shift_change_search   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 558 complete and 0 interrupted iterations
shift_change_search   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 580 complete and 0 interrupted iterations
shift_change_search   [ 100% ] 200 VUs  30.0s/30s

running (0m31.0s), 178/200 VUs, 602 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 156/200 VUs, 624 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m33.0s), 135/200 VUs, 645 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m34.0s), 113/200 VUs, 667 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m35.0s), 092/200 VUs, 688 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m36.0s), 073/200 VUs, 707 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m37.0s), 052/200 VUs, 728 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m38.0s), 030/200 VUs, 750 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m39.0s), 008/200 VUs, 772 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<300' p(95)=10.58s


  █ TOTAL RESULTS 

    checks_total.......: 780     19.832901/s
    checks_succeeded...: 100.00% 780 out of 780
    checks_failed......: 0.00%   0 out of 780

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=8.88s min=460.53ms med=9.7s max=11.22s p(90)=10.45s p(95)=10.58s
      { expected_response:true }...: avg=8.88s min=460.53ms med=9.7s max=11.22s p(90)=10.45s p(95)=10.58s
    http_req_failed................: 0.00%  0 out of 780
    http_reqs......................: 780    19.832901/s

    EXECUTION
    iteration_duration.............: avg=8.88s min=467.91ms med=9.7s max=11.23s p(90)=10.45s p(95)=10.58s
    iterations.....................: 780    19.832901/s
    vus............................: 8      min=8        max=200
    vus_max........................: 200    min=200      max=200

    NETWORK
    data_received..................: 2.8 GB 72 MB/s
    data_sent......................: 81 kB  2.1 kB/s



running (0m39.3s), 000/200 VUs, 780 complete and 0 interrupted iterations
shift_change_search ✓ [ 100% ] 200 VUs  30s